RegistryOffice/src/main/resources/RegistryOffice.bpmn

<?xml version="1.0" encoding="UTF-8"?>
<bpmn:definitions xmlns:bpmn="http://www.omg.org/spec/BPMN/20100524/MODEL" xmlns:bpmndi="http://www.omg.org/spec/BPMN/20100524/DI" xmlns:dc="http://www.omg.org/spec/DD/20100524/DC" xmlns:di="http://www.omg.org/spec/DD/20100524/DI" xmlns:camunda="http://camunda.org/schema/1.0/bpmn" id="Definitions_0fr9mxs" targetNamespace="http://bpmn.io/schema/bpmn" exporter="Camunda Modeler" exporterVersion="5.0.0">
  <bpmn:process id="RegistryOffice" isExecutable="true">
    <bpmn:startEvent id="farmOpeningNotificationType" name="Farm Opening Requested">
      <bpmn:outgoing>Flow_1iy2rtr</bpmn:outgoing>
      <bpmn:messageEventDefinition id="MessageEventDefinition_1nc86a3" messageRef="Message_0pt8j0v" />
    </bpmn:startEvent>
    <bpmn:endEvent id="Event_0sbyc4s">
      <bpmn:incoming>Flow_18ut5jr</bpmn:incoming>
    </bpmn:endEvent>
    <bpmn:scriptTask id="Activity_11ggnb0" name="hellow" scriptFormat="javascript">
      <bpmn:incoming>Flow_1ygwb1n</bpmn:incoming>
      <bpmn:outgoing>Flow_18ut5jr</bpmn:outgoing>
      <bpmn:script>var system = java.lang.System;
system.out.println("Hello World!")</bpmn:script>
    </bpmn:scriptTask>
    <bpmn:sequenceFlow id="Flow_1iy2rtr" sourceRef="farmOpeningNotificationType" targetRef="Gateway_1c7zy2e" />
    <bpmn:sequenceFlow id="Flow_18ut5jr" sourceRef="Activity_11ggnb0" targetRef="Event_0sbyc4s" />
    <bpmn:exclusiveGateway id="Gateway_1c7zy2e">
      <bpmn:incoming>Flow_1iy2rtr</bpmn:incoming>
      <bpmn:outgoing>Flow_0aa3gge</bpmn:outgoing>
      <bpmn:outgoing>Flow_0zv94f9</bpmn:outgoing>
    </bpmn:exclusiveGateway>
    <bpmn:sequenceFlow id="Flow_0aa3gge" sourceRef="Gateway_1c7zy2e" targetRef="Gateway_14vgghe" />
    <bpmn:sequenceFlow id="Flow_0zv94f9" sourceRef="Gateway_1c7zy2e" targetRef="Activity_0bt5g6o" />
    <bpmn:exclusiveGateway id="Gateway_14vgghe">
      <bpmn:incoming>Flow_0aa3gge</bpmn:incoming>
      <bpmn:incoming>Flow_14yo2lh</bpmn:incoming>
      <bpmn:outgoing>Flow_1ygwb1n</bpmn:outgoing>
    </bpmn:exclusiveGateway>
    <bpmn:sequenceFlow id="Flow_1ygwb1n" sourceRef="Gateway_14vgghe" targetRef="Activity_11ggnb0" />
    <bpmn:sendTask id="Activity_0bt5g6o" name="Send Farm Healthcare Registration">
      <bpmn:extensionElements>
        <camunda:connector>
          <camunda:inputOutput>
            <camunda:inputParameter name="url">http://localhost:7080/Veterinary</camunda:inputParameter>
            <camunda:inputParameter name="payload">&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vet="http://eu.chorevolution.farmbusinessstartup/veterinary"&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;vet:farmRegistrationNotificationElementRequest&gt;
         &lt;choreographyId&gt;
            &lt;choreographyId&gt;${farmOpeningNotificationType.choreographyId.choreographyId}&lt;/choreographyId&gt;
         &lt;/choreographyId&gt;
         &lt;senderParticipantName&gt;${farmOpeningNotificationType.senderParticipantName}&lt;/senderParticipantName&gt;
         &lt;receiverParticipantName&gt;${farmOpeningNotificationType.receiverParticipantName}&lt;/receiverParticipantName&gt;
         &lt;choreographyTaskName&gt;${farmOpeningNotificationType.choreographyTaskName}&lt;/choreographyTaskName&gt;
         &lt;inputMessageName&gt;${farmOpeningNotificationType.inputMessageName}&lt;/inputMessageName&gt;
         &lt;inputMessageData&gt;
            &lt;farmCode&gt;Prova1&lt;/farmCode&gt;
            &lt;farmName&gt;${farmOpeningNotificationType.inputMessageName.farmName}&lt;/farmName&gt;
            &lt;siteAddress&gt;
               &lt;city&gt;${farmOpeningNotificationType.inputMessageName.siteAddress.city}&lt;/city&gt;
               &lt;street&gt;${farmOpeningNotificationType.inputMessageName.siteAddress.street}&lt;/street&gt;
               &lt;postcode&gt;${farmOpeningNotificationType.inputMessageName.siteAddress.postcode}&lt;/postcode&gt;
            &lt;/siteAddress&gt;
            &lt;farmSurface&gt;${farmOpeningNotificationType.inputMessageName.farmSurface}&lt;/farmSurface&gt;
            &lt;productionType&gt;${farmOpeningNotificationType.inputMessageName.productionType}&lt;/productionType&gt;
            &lt;breedingMethodologyType&gt;${farmOpeningNotificationType.inputMessageName.breedingMethodologyType}&lt;/breedingMethodologyType&gt;
         &lt;/inputMessageData&gt;
      &lt;/vet:farmRegistrationNotificationElementRequest&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</camunda:inputParameter>
            <camunda:inputParameter name="headers">
              <camunda:map>
                <camunda:entry key="Content-Type">text/xml</camunda:entry>
              </camunda:map>
            </camunda:inputParameter>
          </camunda:inputOutput>
          <camunda:connectorId>soap-http-connector</camunda:connectorId>
        </camunda:connector>
      </bpmn:extensionElements>
      <bpmn:incoming>Flow_0zv94f9</bpmn:incoming>
      <bpmn:outgoing>Flow_14yo2lh</bpmn:outgoing>
    </bpmn:sendTask>
    <bpmn:sequenceFlow id="Flow_14yo2lh" sourceRef="Activity_0bt5g6o" targetRef="Gateway_14vgghe" />
  </bpmn:process>
  <bpmn:message id="Message_0pt8j0v" name="farmOpeningNotificationType" />
  <bpmndi:BPMNDiagram id="BPMNDiagram_1">
    <bpmndi:BPMNPlane id="BPMNPlane_1" bpmnElement="RegistryOffice">
      <bpmndi:BPMNEdge id="Flow_1iy2rtr_di" bpmnElement="Flow_1iy2rtr">
        <di:waypoint x="208" y="250" />
        <di:waypoint x="305" y="250" />
      </bpmndi:BPMNEdge>
      <bpmndi:BPMNEdge id="Flow_18ut5jr_di" bpmnElement="Flow_18ut5jr">
        <di:waypoint x="860" y="250" />
        <di:waypoint x="932" y="250" />
      </bpmndi:BPMNEdge>
      <bpmndi:BPMNEdge id="Flow_0aa3gge_di" bpmnElement="Flow_0aa3gge">
        <di:waypoint x="355" y="250" />
        <di:waypoint x="615" y="250" />
      </bpmndi:BPMNEdge>
      <bpmndi:BPMNEdge id="Flow_0zv94f9_di" bpmnElement="Flow_0zv94f9">
        <di:waypoint x="330" y="225" />
        <di:waypoint x="330" y="120" />
        <di:waypoint x="450" y="120" />
      </bpmndi:BPMNEdge>
      <bpmndi:BPMNEdge id="Flow_1ygwb1n_di" bpmnElement="Flow_1ygwb1n">
        <di:waypoint x="665" y="250" />
        <di:waypoint x="760" y="250" />
      </bpmndi:BPMNEdge>
      <bpmndi:BPMNEdge id="Flow_14yo2lh_di" bpmnElement="Flow_14yo2lh">
        <di:waypoint x="550" y="120" />
        <di:waypoint x="640" y="120" />
        <di:waypoint x="640" y="225" />
      </bpmndi:BPMNEdge>
      <bpmndi:BPMNShape id="Event_1fqhwd5_di" bpmnElement="farmOpeningNotificationType">
        <dc:Bounds x="172" y="232" width="36" height="36" />
        <bpmndi:BPMNLabel>
          <dc:Bounds x="155" y="275" width="71" height="27" />
        </bpmndi:BPMNLabel>
      </bpmndi:BPMNShape>
      <bpmndi:BPMNShape id="Event_0sbyc4s_di" bpmnElement="Event_0sbyc4s">
        <dc:Bounds x="932" y="232" width="36" height="36" />
      </bpmndi:BPMNShape>
      <bpmndi:BPMNShape id="Activity_0vzel4q_di" bpmnElement="Activity_11ggnb0">
        <dc:Bounds x="760" y="210" width="100" height="80" />
        <bpmndi:BPMNLabel />
      </bpmndi:BPMNShape>
      <bpmndi:BPMNShape id="Gateway_1c7zy2e_di" bpmnElement="Gateway_1c7zy2e" isMarkerVisible="true">
        <dc:Bounds x="305" y="225" width="50" height="50" />
      </bpmndi:BPMNShape>
      <bpmndi:BPMNShape id="Gateway_14vgghe_di" bpmnElement="Gateway_14vgghe" isMarkerVisible="true">
        <dc:Bounds x="615" y="225" width="50" height="50" />
      </bpmndi:BPMNShape>
      <bpmndi:BPMNShape id="BPMNShape_13l8a9c" bpmnElement="Activity_0bt5g6o">
        <dc:Bounds x="450" y="80" width="100" height="80" />
        <bpmndi:BPMNLabel />
      </bpmndi:BPMNShape>
    </bpmndi:BPMNPlane>
  </bpmndi:BPMNDiagram>
</bpmn:definitions>
